transient/fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../../nozzleDict"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $Patm;

boundaryField
{
    jetInlet
    {
        type         inletOutlet;
        value        $internalField;
        inletValue   uniform $Patm;
    }
    jetOutlet
    {
        type         fixedValue;
        value        uniform $PjetOut;
    }
    airInlet
    {
        type         fixedValue;
        value        uniform $Patm;
    }
    airOutlet
    {
        type         fixedValue;
        value        uniform $Patm;
    }
    walls
    {
        type            zeroGradient;
    }
    fastWalls
    {
        type            zeroGradient;
    }
    top
    {
        type         fixedValue;
        value        uniform $Patm;
    }
    axis
    {
        type            empty;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
}


// ************************************************************************* //
